Revit 2024 API
ViewPlan.SetViewRange Method
 Sets the view range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetViewRange(
	PlanViewRange planViewRange
)
Visual Basic
Public Sub SetViewRange ( _
	planViewRange As PlanViewRange _
)
Visual C++
public:
void SetViewRange(
	PlanViewRange^ planViewRange
)
Parameters
planViewRange
Type: Autodesk.Revit.DB.PlanViewRange
 The view range.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Plan view range is not valid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ViewPlan Class
Autodesk.Revit.DB Namespace